Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=c29a0875-d216-4aad-89d9-0c7bc4830bdf]
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-Pallavi-Nellore]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-Pallavi-Nellore]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=pallavinellore27]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_fe9cc129-a29a-49e9-b8b5-f73082eb3a8e.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-Pallavi-Nellore:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello-kitty-function-Pallavi-Nellore]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-function-Pallavi-Nellore]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-pallavinellore27]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=pallavinellore27]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=pallavinellore27]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=pallavinellore27]
module.appcd_2f4387a1-6653-4d44-8d79-4b6d3faa3f44.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-Pallavi-Nellore:aws_s3-hello-kitty-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ arn                            = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Pallavi-Nellore" -> (known after apply)
      ~ code_sha256                    = "ThpXeTZobED3ATPn7m4pXZIgyOEqiZM/qo5OX/My6zE=" -> (known after apply)
      ~ function_name                  = "hello-kitty-function-Pallavi-Nellore" -> "hello-kitty-function-pallavinellore27" # forces replacement
      ~ id                             = "hello-kitty-function-Pallavi-Nellore" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Pallavi-Nellore/invocations" -> (known after apply)
      ~ last_modified                  = "2024-09-28T10:03:33.347+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Pallavi-Nellore:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Pallavi-Nellore:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::222634395437:role/hello-kitty-role-Pallavi-Nellore" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 2168 -> (known after apply)
        tags                           = {
            "appstack"  = "Hello-Kitty"
            "component" = "hello-kitty"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "Pallavi-Nellore" -> "pallavinellore27"
            }
        }

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/hello-kitty-function-Pallavi-Nellore" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
      ~ function_arn       = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Pallavi-Nellore" -> (known after apply)
      ~ function_name      = "hello-kitty-function-Pallavi-Nellore" -> "hello-kitty-function-pallavinellore27" # forces replacement
      ~ function_url       = "https://xeuxqxmlxc22uezxlooo62gh4e0knprs.lambda-url.us-west-2.on.aws/" -> (known after apply)
      ~ id                 = "hello-kitty-function-Pallavi-Nellore" -> (known after apply)
      ~ url_id             = "xeuxqxmlxc22uezxlooo62gh4e0knprs" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.appcd_2f4387a1-6653-4d44-8d79-4b6d3faa3f44.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-role-Pallavi-Nellore:aws_s3-hello-kitty-policy" -> (known after apply)
        name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      ~ role        = "hello-kitty-role-Pallavi-Nellore" -> "hello-kitty-role-pallavinellore27" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Pallavi-Nellore" -> (known after apply)
      ~ id                = "/aws/lambda/hello-kitty-function-Pallavi-Nellore" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/hello-kitty-function-Pallavi-Nellore" -> "/aws/lambda/hello-kitty-function-pallavinellore27" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "appstack"  = "Hello-Kitty"
            "component" = "hello-kitty"
        }
        # (4 unchanged attributes hidden)
    }

  # module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::222634395437:role/hello-kitty-role-Pallavi-Nellore" -> (known after apply)
      ~ create_date           = "2024-09-28T10:03:24Z" -> (known after apply)
      ~ id                    = "hello-kitty-role-Pallavi-Nellore" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "hello-kitty-role-Pallavi-Nellore" -> "hello-kitty-role-pallavinellore27" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "appstack"  = "Hello-Kitty"
            "component" = "hello-kitty"
        }
      ~ unique_id             = "AROATHVQLI4WX5ESZFNAH" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "Writer" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Pallavi-Nellore",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Pallavi-Nellore:*",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "aws_s3-hello-kitty-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "kms:Decrypt",
                              - "kms:Encrypt",
                              - "kms:GenerateDataKey",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:kms:us-west-2:222634395437:key/c29a0875-d216-4aad-89d9-0c7bc4830bdf",
                            ]
                          - Sid      = "AllowKmsAccess"
                        },
                      - {
                          - Action   = [
                              - "s3:PutObject",
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:GetObjectVersion",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::pallavinellore27",
                              - "arn:aws:s3:::pallavinellore27/*",
                            ]
                          - Sid      = "hellokittyIMAGESBUCKETS3Bucket551e1d2b88ec540687cfc51521bbe894"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.appcd_fe9cc129-a29a-49e9-b8b5-f73082eb3a8e.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-role-Pallavi-Nellore:Writer" -> (known after apply)
        name        = "Writer"
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Pallavi-Nellore",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Pallavi-Nellore:*",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role        = "hello-kitty-role-Pallavi-Nellore" -> "hello-kitty-role-pallavinellore27" # forces replacement
    }

Plan: 6 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_pallavi_nellore_arn   = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Pallavi-Nellore" -> null
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_pallavi_nellore_name  = "/aws/lambda/hello-kitty-function-Pallavi-Nellore" -> null
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_pallavinellore27_arn  = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_pallavinellore27_name = "/aws/lambda/hello-kitty-function-pallavinellore27"
  - aws_iam_role_hello_kitty_role_pallavi_nellore_arn                              = "arn:aws:iam::222634395437:role/hello-kitty-role-Pallavi-Nellore" -> null
  - aws_iam_role_hello_kitty_role_pallavi_nellore_name                             = "hello-kitty-role-Pallavi-Nellore" -> null
  + aws_iam_role_hello_kitty_role_pallavinellore27_arn                             = (known after apply)
  + aws_iam_role_hello_kitty_role_pallavinellore27_name                            = "hello-kitty-role-pallavinellore27"
  - aws_lambda_hello_kitty_function_pallavi_nellore_function_arn                   = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Pallavi-Nellore" -> null
  - aws_lambda_hello_kitty_function_pallavi_nellore_function_name                  = "hello-kitty-function-Pallavi-Nellore" -> null
  - aws_lambda_hello_kitty_function_pallavi_nellore_function_url                   = "https://xeuxqxmlxc22uezxlooo62gh4e0knprs.lambda-url.us-west-2.on.aws/" -> null
  - aws_lambda_hello_kitty_function_pallavi_nellore_invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Pallavi-Nellore/invocations" -> null
  + aws_lambda_hello_kitty_function_pallavinellore27_function_arn                  = (known after apply)
  + aws_lambda_hello_kitty_function_pallavinellore27_function_name                 = "hello-kitty-function-pallavinellore27"
  + aws_lambda_hello_kitty_function_pallavinellore27_function_url                  = (known after apply)
  + aws_lambda_hello_kitty_function_pallavinellore27_invoke_arn                    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```